**Name of the Student: Dipesh Joshi** <br>
**Roll number: 17**

In [ ]:
# import required libraries
import psycopg2
import pandas as pd
import pandas.io.sql as sqlio

### Use NorthWind Database for Q.1 to Q.17

In [ ]:
# Set up connection with NorthWind Database
conn = None
connectionUrl = "postgres://postgres:mnddj@localhost:5432/NorthWindDB"
try:
    # connecting to local NorthWindDB setup with uri
    conn = psycopg2.connect(connectionUrl)
    conn.autocommit = True # for not transactional queries
    print("Connection was Successful.")
except Exception as E:
    print(f"Error: {E}")

1. Which shippers do we have?( Hint: We have a table called Shippers. Return all the fields from all the shippers)

In [ ]:
qry = """SELECT * FROM shippers"""
result = pd.read_sql(qry, conn)
print(result)

2. Write a SQL query to see first name, last name and hire date of all the employees with the title of **sales representative.**

In [ ]:
qry = """SELECT first_name, last_name, hire_date FROM employees WHERE title = 'Sales Representative'"""
result = pd.read_sql(qry, conn)
print(result)

3. Write a SQL query to extract first name, last name and hire date of only those employees that have the title of Sales Representative, and also are in the United States.

In [ ]:
qry = """SELECT first_name, last_name, hire_date FROM employees WHERE title = 'Sales Representative' AND country = 'USA'"""
result = pd.read_sql(qry, conn)
print(result)

4. Show all the orders placed by the Employee "Stevan Buchanan" whose employee id is 5.

In [ ]:
qry = """SELECT * FROM orders WHERE employee_id = 5"""
result = pd.read_sql(qry, conn)
print(result)

5. Show the SupplierID, ContactName and ContactTitle for those suppliers whose ContactTitle is not Marketing Manager. (Hint: Suppliers Table)

In [ ]:
qry = """SELECT supplier_id, contact_name, contact_title FROM suppliers WHERE contact_title <> 'Marketing Manager'"""
result = pd.read_sql(qry, conn)
print(result)

6. Write a SQL query to see the ProductID and ProductName for those products where the ProductName includes the string "queso"

In [ ]:
qry = """SELECT product_id, product_name FROM products WHERE product_name LIKE '%queso%'"""
result = pd.read_sql(qry, conn)
print(result)

7. Write a query that shows the OrderID, CustomerID and ShipCountry for the orders where the ShipCountry is either France or Belgium.

In [ ]:
qry = """SELECT order_id, customer_id, ship_country FROM orders WHERE ship_country IN ('France', 'Belgium')"""
result = pd.read_sql(qry, conn)
print(result)

8. For all the employees table, show the FirstName, LastName, Title and BirthDate. Order the results by BirthDate, so we have the oldest employees first.

In [ ]:
qry = """SELECT first_name, last_name, title, birth_date FROM employees ORDER BY birth_date DESC"""
result = pd.read_sql(qry, conn)
print(result)

9. In the output of the query above, Show only the date portion of the BirthDate field.

In [ ]:
qry = """SELECT a.birth_date FROM (SELECT first_name, last_name, title, birth_date FROM employees ORDER BY birth_date DESC) AS a"""
result = pd.read_sql(qry, conn)
print(result)

10. Show the firstName and LastName columns from the Employees table, and then create a new column called FullName, showing FirstName and LastName joined together in one column, with a space in-between.

In [ ]:
qry = """
ALTER TABLE employees ADD IF NOT EXISTS full_name varchar(20);
UPDATE employees AS e SET full_name = (SELECT CONCAT(e.first_name, ' ', e.last_name));
SELECT * FROM employees;
"""
result = pd.read_sql(qry, conn)
print(result)

11. In the OrderDetails table, Create a new field, Total Price that multiplies UnitPrice and Quantity. In addition, show the OrderID, ProductID, UnitPrice and Quantity. Order by OrderID and ProductID.

In [ ]:
qry1 = """
ALTER TABLE order_details ADD IF NOT EXISTS total_price real;
UPDATE order_details AS od SET total_price = (SELECT od.unit_price * od.quantity);
SELECT order_id, product_id, unit_price, quantity FROM order_details ORDER BY order_id, product_id;
"""
result = pd.read_sql(qry, conn)
print(result)

12. How many customers do we have in the Customers table? Show one value only.

In [ ]:
qry = """
SELECT COUNT(customer_id) FROM customers
"""
result = pd.read_sql(qry, conn)
print(result.iat[0, 0])

13. Show the date of the first order ever made in the Orders table.

In [ ]:
qry1 = """
SELECT order_date FROM orders ORDER BY order_date
"""
result = pd.read_sql(qry, conn)
print(result.iat[0, 0])

14. Show a list of countries where the Northwind company has customers.

In [ ]:
qry = """
SELECT DISTINCT country FROM customers
"""
result = pd.read_sql(qry, conn)
print(result)

15. Show a list of all the diffrent values in the Customers table for ContactTitles. Also, include count for each ContactTitle

In [ ]:
qry = """
SELECT contact_title, COUNT(contact_title) FROM customers GROUP BY contact_title
"""
result = pd.read_sql(qry, conn)
print(result)

16. Show the ProductID, ProductName, and the CompanyName of the Supplier. Sort by ProductID. (Hint: use Products and Suppliers Table)

In [ ]:
qry = """
SELECT p.product_id, p.product_name, s.company_name 
FROM products AS p, suppliers AS s
ORDER BY p.product_id
"""
result = pd.read_sql(qry, conn)
print(result)

17. Show the OrderID, OrderDate(date only) and CompanyName of the Shipper, and sort by OrderID. ALso, Show only those rows with an OrderID of less than 10300.

In [ ]:
qry = """
SELECT order_id, order_date, ship_name FROM orders WHERE order_id < 10300 ORDER BY order_id
"""
result = pd.read_sql(qry, conn)
print(result)

## Use DVD Rental Database

18. Find the difference between the total number of CITY entries in the table and the number of distinct CITY entries in the table.

In [ ]:
qry = """
SELECT COUNT(city) - COUNT(DISTINCT city) FROM city
"""
result = pd.read_sql(qry, conn)
print(result)

19. Find the duplicate city enteries in the city table

In [ ]:
qry = """
SELECT city, COUNT(city) FROM city GROUP BY city HAVING COUNT(*) > 1
"""
result = pd.read_sql(qry, conn)
print(result)

20. Find all the cities with even city_id.

In [ ]:
qry = """
SELECT city FROM city WHERE (city_id % 2) = 0
"""
result = pd.read_sql(qry, conn)
print(result)

21. Find all the cities with odd city_id.

In [ ]:
qry = """
SELECT city FROM city WHERE (city_id % 2) <> 0
"""
result = pd.read_sql(qry, conn)
print(result)

22. Query the two cities in city table with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.

In [ ]:
qry = """
(Select city, LENGTH(city) FROM city ORDER BY LENGTH(city) DESC LIMIT 1)
UNION ALL
(Select city, LENGTH(city) FROM city ORDER BY LENGTH(city) LIMIT 1)
"""
result = pd.read_sql(qry, conn)
print(result)

23. Query the list of country names starting with vowels (i.e., a, e, i, o, or u) from country table. Your result cannot contain duplicates.

In [ ]:
qry = """
SELECT DISTINCT country
FROM country
WHERE country ~* '^[aeiouAEIOU].*';
"""
result = pd.read_sql(qry, conn)
print(result)

24. Query the list of country names ending with vowels (a, e, i, o, u) from country table. Your result cannot contain duplicates.

In [ ]:
qry = """
SELECT DISTINCT country
FROM country
WHERE country ~* '[aeiouAEIOU]$';
"""
result = pd.read_sql(qry, conn)
print(result)

25. Query the list of country names from country which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.

In [ ]:
qry = """
SELECT DISTINCT country
FROM country
WHERE country ~* '^[aeiouAEIOU].*[aeiouAEIOU]$';
"""
result = pd.read_sql(qry, conn)
print(result)

26. Write a query to get the first_name from the actor table in the upper case using the alias name as ActorName.

In [ ]:
qry = """
SELECT UPPER(first_name) as ActorName FROM actor
"""
result = pd.read_sql(qry, conn)
print(result)

27. Write a query to fetch the current date?

In [ ]:
qry = """
SELECT CURRENT_DATE;
"""
result = pd.read_sql(qry, conn)
print(result)